# ===========================
# SHELL ENVIRONMENT TOOLS
# ===========================
brew "direnv"                 # Auto-load project-specific environment variables

# ===========================
# CORE FILE SEARCH & NAVIGATION TOOLS
# ===========================
brew "fd"              # Fast find alternative (used in fzf commands)
brew "fzf"             # Fuzzy finder (heavily used in aliases)
brew "ripgrep"         # Fast grep alternative (has config file)
brew "bat"             # Cat with syntax highlighting (used in fzf previews)

# ===========================
# DIRECTORY & FILE MANAGEMENT
# ===========================
brew "lsd"             # Modern ls replacement (used in aliases)
brew "eza"             # Modern ls replacement (used in fzf previews)
brew "zoxide"          # Smart cd replacement (used in zz alias)
brew "tree"            # Directory tree viewer (used as fallback)
brew "broot"           # Interactive directory navigation (has config)
brew "chezmoi"         # Dotfiles manager
brew "zellij"          # Terminal multiplexer

# ===========================
# DEVELOPMENT TOOLS
# ===========================
brew "neovim"          # Editor (aliased as vim, vi, v)
brew "docker"          # Containerization (has aliases and functions)
brew "kubernetes-cli"  # Kubectl (lazy loaded in zshrc)
brew "lazygit"         # Git TUI
brew "git-delta"       # Better git diffs (configured in .gitconfig.d/tools)
brew "difftastic"      # Syntax-aware structural diffs (used by git difftool and lazygit)
brew "gh"              # GitHub CLI
# ===========================
# SYSTEM MONITORING
# ===========================
brew "btop"            # System monitor (has config directory)
cask "stats"           # macOS menu bar system monitor (CPU, memory, disk, network)

# ===========================
# ZSH ENHANCEMENTS
# ===========================
brew "powerlevel10k"   # ZSH theme

# ===========================
# LANGUAGE-SPECIFIC TOOLS
# ===========================
brew "oven-sh/bun/bun"        # JavaScript runtime and toolkit
brew "fnm"                    # fast node manager

# ===========================
# LSP SERVERS (Claude Code / LSP plugins)
# ===========================
brew "llvm"                        # clangd (C/C++)
brew "gopls"                       # gopls (Go)
brew "jdtls"                       # jdtls (Java)
brew "lua-language-server"         # lua-language-server (Lua)
brew "pyright"                     # pyright-langserver (Python)
brew "rust-analyzer"               # rust-analyzer (Rust)
brew "typescript-language-server"  # typescript-language-server (TypeScript)

# ===========================
# BENCHMARKING & UTILITIES
# ===========================
brew "hyperfine"       # Command-line benchmarking tool (used in scripts)
brew "jq"              # JSON processor (found installed)
brew "curl"            # URL transfer tool (used in nvim install)
brew "wget"            # Network downloader (used in nvim install)
brew "atuin"           # Shell history database with sync and search

# ===========================
# APPLICATIONS & TOOLS
# ===========================
cask "ghostty"                # Terminal emulator (extensive config in dotfiles)
cask "git-credential-manager" # Git credential helper (referenced in .gitconfig)
cask "miniconda"              # Python environment manager (lazy loaded in zshrc)
cask "kitty"                  # Terminal emulator (has config in dotfiles)
cask "linearmouse"            # Mouse configuration tool (has config)
brew "stats"                  # CPU, Memory, and Bandwidth stats on the menu ar.

# ===========================
# FONTS
# ===========================
cask "font-jetbrains-mono-nerd-font"  # JetBrains Mono with Nerd Font patches (ligatures support)
